diagrama en el readme
